let gon = Array("0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "1");
let gonrusname = Array("Вода Инь (Облачко)", "Дерево Ян (Дубочки)", "Дерево Инь (Вьюночки)", "Огонь Ян (Солнышки)", "Огонь Инь (Угольки)", "Земля Ян (Скала)", "Земля Инь (Пашня)", "Металл Ян (Меч)", "Металл Инь (Мерстень)", "Вода Ян (Океан)", "Вода Инь (Облачко)", "Дерево Ян (Дубочки)", "Дерево Инь (Вьюночки)", "Огонь Ян (Солнышки)", "Огонь Инь (Угольки)");
let gonrusSym = Array("癸", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁");
let gonrusSymColors = Array("#0082FF", "#348B2E", "#348B2E", "#F00000", "#F00000", "#6A3814", "#6A3814", "#708090", "#708090", "#0082FF", "#0082FF", "#348B2E", "#348B2E", "#F00000", "#F00000");


let symColors = {
  "甲": "#348B2E",
  "癸": "#0082FF",
  "乙": "#348B2E",
  "丙": "#F00000",
  "丁": "#F00000",
  "戊": "#6A3814",
  "己": "#6A3814",
  "庚": "#708090",
  "辛": "#708090",
  "壬": "#0082FF",
}

let energySym = {

  1: {

    "甲": ['丙', '癸'],
    "乙": ['丙', '癸'],
    "丙": ["壬", "庚"],
    "丁": ["甲", "庚"],
    "戊": ["丙", '癸', '甲'],
    "己": ['丙', '甲', '庚'],
    "庚": ['戊', '丙', '甲', '丁', '壬'],
    "辛": ['己', '庚', '壬'],
    "壬": ['庚', '戊', '丙'],
    "癸": ['辛', '丙'],

  },

  2: {
    "甲": ['庚', '戊', '丙', '己', '丁'],
    "乙": ['丙', '癸'],
    "丙": ['壬', '己'],
    "丁": ['庚', '甲'],
    "戊": ['丙', '癸', '甲'],
    "己": ['甲', '丙', '癸'],
    "庚": ['丁', '丙', '甲', '庚'],
    "辛": ['壬', '甲'],
    "壬": ['戊', '庚', '辛'],
    "癸": ['庚', '辛'],
  },

  3: {
    "甲": ['庚', '壬', '丁'],
    "乙": ['癸', '戊', '丙'],
    "丙": ['壬', '甲', ],
    "丁": ["甲", "庚"],
    "戊": ['甲', '癸', '丙'],
    "己": ['丙', '甲', '癸'],
    "庚": ['甲', '壬', '丁', '癸'],
    "辛": ['壬', '甲', ],
    "壬": ['甲', '庚', ],
    "癸": ['丙', '甲', '辛'],
  },

  4: {
    "甲": ['癸', '庚', '丁'],
    "乙": ['癸', ],
    "丙": ['壬', '癸', '庚'],
    "丁": ['甲', '庚', ],
    "戊": ['甲', '癸', '丙'],
    "己": ['癸', '丙', ],
    "庚": ['壬', '丙', '戊', '丁'],
    "辛": ['壬', '癸', '甲'],
    "壬": ['壬', '庚', '辛', '癸'],
    "癸": ['辛', ],
  },

  5: {
    "甲": ['癸', '庚', '丁'],
    "乙": ['癸', '丙', ],
    "丙": ['壬', '庚', ],
    "丁": ['壬', '癸', '庚'],
    "戊": ['壬', '丙', '甲'],
    "己": ['癸', '丙', ],
    "庚": ['壬', '癸', ],
    "辛": ['壬', '癸', '己'],
    "壬": ['癸', '辛', '庚'],
    "癸": ['庚', '癸', '壬'],
  },

  6: {
    "甲": ['癸', '庚', '丁'],
    "乙": ['癸', '丙', ],
    "丙": ['壬', '庚', ],
    "丁": ['甲', '庚', '壬'],
    "戊": ['癸', '甲', '丙'],
    "己": ['癸', '丙', ],
    "庚": ['丁', '甲', ],
    "辛": ['壬', '甲', '庚'],
    "壬": ['辛', '甲', ],
    "癸": ['庚', '壬', '辛', '癸'],
  },

  7: {
    "甲": ['庚', '壬', '丁'],
    "乙": ['丙', '己', '癸'],
    "丙": ['壬', '戊', ],
    "丁": ['甲', '丙', '庚', '戊'],
    "戊": ['丙', '甲', '癸'],
    "己": ['丙', '癸', ],
    "庚": ['丁', '甲', ],
    "辛": ['壬', '戊', '甲'],
    "壬": ['戊', '丁', ],
    "癸": [''],
  },

  8: {
    "甲": ['庚', '丙', '丁'],
    "乙": ['癸', '丁', '丙'],
    "丙": ['癸', '丁', '丙'],
    "丁": ['甲', '丙', '庚', '戊]'],
    "戊": ['丙', '癸', ],
    "己": ['丙', '癸', ],
    "庚": ['丁', '丙', '甲'],
    "辛": ['壬', '甲', ],
    "壬": ['甲', '庚', ],
    "癸": ['辛', '丙', ],
  },

  9: {
    "甲": ['庚', '壬', '甲', '癸', '丁'],
    "乙": ['癸', '辛', ],
    "丙": ['甲', '壬', ],
    "丁": ['甲', '戊', '庚'],
    "戊": ['甲', '癸', '丙'],
    "己": ['甲', '癸', '丙'],
    "庚": ['甲', '壬', ],
    "辛": ['壬', '甲', ],
    "壬": ['甲', '丙', ],
    "癸": ['辛', '壬', '甲', '癸'],
  },

  10: {
    "甲": ['丙', '庚', '戊', '丁'],
    "乙": ['丙', '戊', ],
    "丙": ['甲', '庚', '戊', '壬'],
    "丁": ['甲', '庚', ],
    "戊": ['甲', '丙', ],
    "己": ['丙', '戊', '甲'],
    "庚": ['丁', '丙', ],
    "辛": ['壬', '丙', ],
    "壬": ['戊', '庚', '丙'],
    "癸": ['庚', '戊', '辛', '丁'],
  },

  11: {
    "甲": ['丁', '丙', '庚'],
    "乙": ['丙', ],
    "丙": ['壬', '己', '戊'],
    "丁": ['甲', '庚', ],
    "戊": ['丙', '甲', ],
    "己": ['丙', '戊', '甲'],
    "庚": ['丁', '丙', '甲'],
    "辛": ['丙', '壬', '戊', '甲'],
    "壬": ['戊', '丙', ],
    "癸": ['丙', '辛', ],
  },

  12: {
    "甲": ['丁', '丙', '庚'],
    "乙": ['丙', ],
    "丙": ['壬', '甲', ],
    "丁": ['甲', '庚', ],
    "戊": ['丙', '甲', ],
    "己": ['丙', '戊', '甲'],
    "庚": ['丙', '甲', '丁'],
    "辛": ['丙', '戊', '壬', '己'],
    "壬": ['丙', '丁', '甲'],
    "癸": ['丙', '丁', ],
  },

}


function compute1(form) {

  let myElemSym = document.querySelector('#myElemSym1');
  let myEnergySym = document.querySelector('#myEnergySym1');
  let myElemName = document.querySelector('#myElemName1');
  let myEnergySymStr = '';

  MM = eval(form.nyuet.value);
  DD = eval(form.nyat.value);
  YY = eval(form.nnin.value);

  with(Math) {
    AAA = 1;
    if (YY <= 1585) AAA = 0;
    JD = -1 * floor(7 * (floor((MM + 9) / 12) + YY) / 4);
    S = 1;
    if ((MM - 9) < 0) S = -1;
    A = abs(MM - 9);
    J1 = floor(YY + S * floor(A / 7));
    J1 = -1 * floor((floor(J1 / 100) + 1) * 3 / 4);
    JD = JD + floor(275 * MM / 9) + DD + (AAA * J1);
    JD = JD + 1721027 + 2 * AAA + 367 * YY - 0.5;
    JZJD = JD;
    T = (JD - 2451545.0) / 36525;
    d = 2 * PI / 360;
    M = 357.52910 + 35999.05030 * T - 0.0001559 * T * T - 0.00000048 * T * T * T;
    L0 = 280.46645 + 36000.76983 * T + 0.0003032 * T * T;
    DL = (1.914600 - 0.004817 * T - 0.000014 * T * T) * sin(d * M);
    DL = DL + (0.019993 - 0.000101 * T) * sin(d * 2 * M) + 0.000290 * sin(d * 3 * M);
    L = L0 + DL;
  }

  with(Math) {
    ds0 = "" + floor(JZJD + 0.5);
    ds = gon[ds0.substring(6, 7)];
    db0 = floor(JZJD - 12 * floor((JZJD + 0.5) / 12) + 0.5) + 2;
  }


  myElemSym.style.color = gonrusSymColors[ds];
  myElemSym.innerHTML = gonrusSym[ds];
  myElemName.innerHTML = gonrusname[ds];

  let energySymArr = energySym[MM][gonrusSym[ds]];

  for (let i = 0; i < energySymArr.length; i++) {
    myEnergySymStr += `<span style = "color:${symColors[energySymArr[i]]}">${energySymArr[i]}</span>`
  }

 

  energySymArr.length === 3 ? myEnergySym.style.fontSize = '75px' :
    energySymArr.length === 4 ? myEnergySym.style.fontSize = '60px' :
    energySymArr.length === 5 ? myEnergySym.style.fontSize = '50px' : myEnergySym.style.fontSize = '100px';

    if (window.innerWidth < 545){
      energySymArr.length === 3 ? myEnergySym.style.fontSize = '45px' :
      energySymArr.length === 4 ? myEnergySym.style.fontSize = '35px' :
      energySymArr.length === 5 ? myEnergySym.style.fontSize = '25px' : myEnergySym.style.fontSize = '55px';
  
    }
  myEnergySym.innerHTML = myEnergySymStr;
}