let calcBtn2 = document.querySelector('.calc2 .calc-btn__item');
let calcForm2= document.querySelector('.calc2 .calc-form');

calcBtn2.addEventListener('click', (e) => {
    let form = e.target.closest('.calc-form');
    compute(form);
});

let gon2 = Array("0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "1");

let gonrusname2 = Array("Вода Инь (Облачко)", "Дерево Ян (Дубочки)", "Дерево Инь (Вьюночки)",
    "Огонь Ян (Солнышки)", "Огонь Инь (Угольки)", "Земля Ян (Скала)", "Земля Инь (Пашня)",
    "Металл Ян (Меч)", "Металл Инь (Перстень)", "Вода Ян (Океан)", "Вода Инь (Облачко)",
    "Дерево Ян (Дубочки)",
    "Дерево Инь (Вьюночки)", "Огонь Ян (Солнышки)", "Огонь Инь (Угольки)");

let gonrusSym2 = Array("癸", "甲", "乙", "丙", "丁", "戊", "己",
    "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁");

let gonrusSymColors2 = Array("#0082FF", "#348B2E", "#348B2E", "#F00000", "#F00000",
    "#6A3814", "#6A3814", "#708090", "#708090", "#0082FF", "#0082FF",
    "#348B2E", "#348B2E", "#F00000", "#F00000");

let symColors2 = {
    "甲": "#348B2E",
    "癸": "#0082FF",
    "乙": "#348B2E",
    "丙": "#F00000",
    "丁": "#F00000",
    "戊": "#6A3814",
    "己": "#6A3814",
    "庚": "#708090",
    "辛": "#708090",
    "壬": "#0082FF",
}

let symStones2 = {
    "癸": ['Аквамарин', 'Флюорит', 'Сапфирин', 'Содалит', 'Лазурит', 'Лунный камень',
        'Лабрадор', 'Голубой кварц', 'Горный хрусталь', 'Шалиграм', 'Агат черный', 'Апатит'
    ],

    "丙": ['Гранат', 'Сердолик', 'Розовый кварц', 'Родонит', 'Чароит', 'Агат ботсвана',
        'Солнечный камень', 'Коралл красный', 'Родохрозит', 'Кварц клубничный'
    ],

    "戊": ['Янтарь', 'Яшма', 'Аметист', 'Топаз', 'Тигровый глаз', 'Цитрин',
        'Раухтопаз', 'Кианит', 'Петерсит', 'Опал'
    ],

    "甲": ['Малахит', 'Бирюза', 'Изумруд', 'Моховой агат', 'Хризолит, амазонит',
        'Сандал красный и черный',
        'Жадеит', 'Лотос', 'Бодхи', 'Агар', 'Нефрит'
    ],

    "庚": ['Жемчуг', 'Кошачий глаз', 'Турмалин полихромный', 'Турмалин шерл',
        'Кварц турмалиновый', 'Кахолонг', 'Гематит', 'Бронзит', 'Петерсит', 'Иолит', 'Гелиодор'
    ],
}
// ---------------------------------------LINKS FOR STONES (ССЫЛКИ НА КАМНИ)------------------------------------------------------
let stonesInfo2 = {
    'Аквамарин': {
        name: 'Аквамарин',
        cost: '12 000',
        link: 'acvamarin',

    },

    'Флюорит': {
        name: 'Флюорит',
        cost: '4 000',
        link: 'fluorit',
    },

    'Сапфирин': {
        name: 'Сапфирин',
        cost: '4 000',
        link: 'sapfirin',
    },

}
// ---------------------------------------LINKS FOR STONES (ССЫЛКИ НА КАМНИ)------------------------------------------------------
symStones2['壬'] = symStones2["癸"];
symStones2["丁"] = symStones2["丙"];
symStones2["己"] = symStones2["戊"];
symStones2["乙"] = symStones2["甲"];
symStones2["辛"] = symStones2["庚"];

let energySym2 = {
    1: {

        "甲": ['丙', '癸'],
        "乙": ['丙', '癸'],
        "丙": ["壬", "庚"],
        "丁": ["甲", "庚"],
        "戊": ["丙", '癸', '甲'],
        "己": ['丙', '甲', '庚'],
        "庚": ['戊', '丙', '甲', '丁', '壬'],
        "辛": ['己', '庚', '壬'],
        "壬": ['庚', '戊', '丙'],
        "癸": ['辛', '丙'],

    },

    2: {
        "甲": ['庚', '戊', '丙', '己', '丁'],
        "乙": ['丙', '癸'],
        "丙": ['壬', '己'],
        "丁": ['庚', '甲'],
        "戊": ['丙', '癸', '甲'],
        "己": ['甲', '丙', '癸'],
        "庚": ['丁', '丙', '甲', '庚'],
        "辛": ['壬', '甲'],
        "壬": ['戊', '庚', '辛'],
        "癸": ['庚', '辛'],
    },

    3: {
        "甲": ['庚', '壬', '丁'],
        "乙": ['癸', '戊', '丙'],
        "丙": ['壬', '甲', ],
        "丁": ["甲", "庚"],
        "戊": ['甲', '癸', '丙'],
        "己": ['丙', '甲', '癸'],
        "庚": ['甲', '壬', '丁', '癸'],
        "辛": ['壬', '甲', ],
        "壬": ['甲', '庚', ],
        "癸": ['丙', '甲', '辛'],
    },

    4: {
        "甲": ['癸', '庚', '丁'],
        "乙": ['癸', ],
        "丙": ['壬', '癸', '庚'],
        "丁": ['甲', '庚', ],
        "戊": ['甲', '癸', '丙'],
        "己": ['癸', '丙', ],
        "庚": ['壬', '丙', '戊', '丁'],
        "辛": ['壬', '癸', '甲'],
        "壬": ['壬', '庚', '辛', '癸'],
        "癸": ['辛', ],
    },

    5: {
        "甲": ['癸', '庚', '丁'],
        "乙": ['癸', '丙', ],
        "丙": ['壬', '庚', ],
        "丁": ['壬', '癸', '庚'],
        "戊": ['壬', '丙', '甲'],
        "己": ['癸', '丙', ],
        "庚": ['壬', '癸', ],
        "辛": ['壬', '癸', '己'],
        "壬": ['癸', '辛', '庚'],
        "癸": ['庚', '癸', '壬'],
    },

    6: {
        "甲": ['癸', '庚', '丁'],
        "乙": ['癸', '丙', ],
        "丙": ['壬', '庚', ],
        "丁": ['甲', '庚', '壬'],
        "戊": ['癸', '甲', '丙'],
        "己": ['癸', '丙', ],
        "庚": ['丁', '甲', ],
        "辛": ['壬', '甲', '庚'],
        "壬": ['辛', '甲', ],
        "癸": ['庚', '壬', '辛', '癸'],
    },

    7: {
        "甲": ['庚', '壬', '丁'],
        "乙": ['丙', '己', '癸'],
        "丙": ['壬', '戊', ],
        "丁": ['甲', '丙', '庚', '戊'],
        "戊": ['丙', '甲', '癸'],
        "己": ['丙', '癸', ],
        "庚": ['丁', '甲', ],
        "辛": ['壬', '戊', '甲'],
        "壬": ['戊', '丁', ],
        "癸": [''],
    },

    8: {
        "甲": ['庚', '丙', '丁'],
        "乙": ['癸', '丁', '丙'],
        "丙": ['癸', '丁', '丙'],
        "丁": ['甲', '丙', '庚', '戊]'],
        "戊": ['丙', '癸', ],
        "己": ['丙', '癸', ],
        "庚": ['丁', '丙', '甲'],
        "辛": ['壬', '甲', ],
        "壬": ['甲', '庚', ],
        "癸": ['辛', '丙', ],
    },

    9: {
        "甲": ['庚', '壬', '甲', '癸', '丁'],
        "乙": ['癸', '辛', ],
        "丙": ['甲', '壬', ],
        "丁": ['甲', '戊', '庚'],
        "戊": ['甲', '癸', '丙'],
        "己": ['甲', '癸', '丙'],
        "庚": ['甲', '壬', ],
        "辛": ['壬', '甲', ],
        "壬": ['甲', '丙', ],
        "癸": ['辛', '壬', '甲', '癸'],
    },

    10: {
        "甲": ['丙', '庚', '戊', '丁'],
        "乙": ['丙', '戊', ],
        "丙": ['甲', '庚', '戊', '壬'],
        "丁": ['甲', '庚', ],
        "戊": ['甲', '丙', ],
        "己": ['丙', '戊', '甲'],
        "庚": ['丁', '丙', ],
        "辛": ['壬', '丙', ],
        "壬": ['戊', '庚', '丙'],
        "癸": ['庚', '戊', '辛', '丁'],
    },

    11: {
        "甲": ['丁', '丙', '庚'],
        "乙": ['丙', ],
        "丙": ['壬', '己', '戊'],
        "丁": ['甲', '庚', ],
        "戊": ['丙', '甲', ],
        "己": ['丙', '戊', '甲'],
        "庚": ['丁', '丙', '甲'],
        "辛": ['丙', '壬', '戊', '甲'],
        "壬": ['戊', '丙', ],
        "癸": ['丙', '辛', ],
    },

    12: {
        "甲": ['丁', '丙', '庚'],
        "乙": ['丙', ],
        "丙": ['壬', '甲', ],
        "丁": ['甲', '庚', ],
        "戊": ['丙', '甲', ],
        "己": ['丙', '戊', '甲'],
        "庚": ['丙', '甲', '丁'],
        "辛": ['丙', '戊', '壬', '己'],
        "壬": ['丙', '丁', '甲'],
        "癸": ['丙', '丁', ],
    },

}

function compute(form) {

    let checkboxTime2 = document.querySelector('#fluency');
    let myElemSym2 = document.querySelector('#myElemSym');
    let myElemName2 = document.querySelector('#myElemName');
    let stonesResultList2 = document.querySelector('.calc__stones-result__list');
    let guaNum2 = document.querySelector('#myGuaNum');
    let stonesOption2 = '';

    TZ2 = form.ITZ.options[form.ITZ.selectedIndex].value;
    MM2 = eval(form.nyuet.value);
    DD2 = eval(form.nyat.value);
    YY2 = eval(form.nnin.value);
    HR2 = eval(form.nsee.value);
    MN2 = eval(form.nfen.value);
    GEN2 = eval(form.BBB.value);
    LON2 = eval(form.longi.value);

    if (checkboxTime2.checked == true) {
        HR2 = 0;
        MN2 = 0;
    }

    with(Math) {
        HR2 = HR2 + (MN2 / 60);
        if ((LON2 > -181) & (LON2 < 181)) HR2 = HR2 + (LON2 / 15 - TZ2);
        AAA2 = 1;
        if (YY2 <= 1585) AAA2 = 0;
        JD2 = -1 * floor(7 * (floor((MM2 + 9) / 12) + YY2) / 4);
        S2 = 1;
        if ((MM2 - 9) < 0) S = -1;
        A2 = abs(MM2 - 9);
        J12 = floor(YY2 + S2 * floor(A2 / 7));
        J12 = -1 * floor((floor(J12 / 100) + 1) * 3 / 4);
        JD2 = JD2 + floor(275 * MM2 / 9) + DD2 + (AAA2 * J12);
        JD2 = JD2 + 1721027 + 2 * AAA2 + 367 * YY2 - 0.5;
        JZJD2 = JD2 + (HR2 / 24);
        JD2 = JD2 + (HR2 / 24) - (TZ2 / 24);
        T2 = (JD2 - 2451545.0) / 36525;
        d2 = 2 * PI / 360;
        M2 = 357.52910 + 35999.05030 * T2 - 0.0001559 * T2 * T2 - 0.00000048 * T2 * T2 * T2;
        L02 = 280.46645 + 36000.76983 * T2 + 0.0003032 * T2 * T2;
        DL2 = (1.914600 - 0.004817 * T2 - 0.000014 * T2 * T2) * sin(d2 * M2);
        DL2 = DL2 + (0.019993 - 0.000101 * T2) * sin(d2 * 2 * M2) + 0.000290 * sin(d2 * 3 * M2);
        L2 = L02 + DL2;
    }

    with(Math) {
        ds02 = "" + floor(JZJD2 + 0.5);
        ds2 = gon2[ds02.substring(6, 7)];
    }

    YEFL2 = 0;
    for (let i = 0; L2 > 360; i++) {
        L2 = L2 - 360;
    }
    for (var i = 0; L2 < 0; i++) {
        L2 = L2 + 360;
    }

    if ((L2 < 315) && (MM2 == 1 || MM2 == 2)) {
        YEFL2 = 1;
    }

    nsky2 = ((3007 - YY2) % 9) + 1;

    if (YEFL2 == 1) {
        nsky2 = nsky2 + 1;
    }

    if (nsky2 == 10) {
        nsky2 = 1;
    }


    YEFL2 = 0;
    for (var i = 0; L2 > 360; i++) {
        L2 = L2 - 360;
    }
    for (var i = 0; L2 < 0; i++) {
        L2 = L2 + 360;
    }
    if ((L2 < 315) && (MM2 == 1 || MM2 == 2)) {
        YEFL2 = 1;
    }


    if ((L2 < 315) && (MM2 == 1 || MM2 == 2)) {
        YEFL2 = 1;
    }

    if (GEN2 == 1) {
        if (nsky2 == 5) {
            mng2 = 2;
        } else {
            mng2 = nsky2;
        }
    } else {
        mng2 = 6 - nsky2;
        if (mng2 == 5) {
            mng2 = 8;
        }
    }
    if (mng2 < 1) {
        mng2 = mng2 + 9;
    }

    let energySymArr2 = energySym2[MM2][gonrusSym2[ds2]];

    myElemSym2.style.color = gonrusSymColors2[ds2];
    myElemSym2.innerHTML = gonrusSym2[ds2];
    myElemName2.innerHTML = gonrusname2[ds2];

    for (let i = 0; i < energySymArr2.length; i++) {

        let stonesOptionSym2 = '';
        let myStonesArr2 = symStones2[energySymArr2[i]];

        for (let j = 0; j < myStonesArr2.length; j++) {

            let myStone2 = `${myStonesArr2[j]}`;

            if (myStone2 in stonesInfo2) {
                let myStoneStr2 = `
                    <li class="calc__stones-result__list-item"> 

                    <div class="stone-name__block stones-result__block">
                        <span class="stone-name">${stonesInfo2[myStone2].name}</span>
                    </div>

                    <div class="stone-cost__block stones-result__block">
                        <span class="stone-cost">${stonesInfo2[myStone2].cost} тг</span> 
                    </div>
                    
                    <div class="buy-stone stones-result__block">
                        <a href="${stonesInfo2[myStone2].link}" class="buy-stone__link">Подробнее</a> 
                    </div>
                
                    </li>
                `;

                stonesOptionSym2 += myStoneStr2;
            }

        }

        stonesOption2 += stonesOptionSym2;
    }

    stonesResultList2.innerHTML = stonesOption2;
    guaNum2.innerHTML = mng2;

}